 # <html -*- mode: org ; coding: utf-8-with-signature -*- >
 # <script src="js/org-render.js"></script><body><!--
 # This renders this org-file directly to html in certain conditions,
 # see for details: https://github.com/AlexStragies/ORGJS-Wrapper

#+Title: The Emacs Config in Org-Mode
#+Author: Alex Stragies
#+LINK: wikipedia    https://en.wikipedia.org/wiki/
#+LINK: firewall     http://langw/
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/org-view.css" />
#+PROPERTY: header-args:emacs-lisp :noweb yes
#+PROPERTY: header-args:awk  :tangle no :results code
#+PROPERTY: header-args:awk+ :wrap SRC emacs-lisp
#+options: toc:t

.. and a small loader in init.el
*** List of installed yasnippets
#+NAME: List-installed-yasnippets
#+HEADER: :tangle no :dir (concat (getenv "HOME") "/.emacs.d/")
#+HEADER: :colnames yes :post add-header-line(*this*)
#+BEGIN_SRC sh
  echo Mode Snippet
  find snippets/ -path snippets/.git -prune -o -type f  -print \
      | grep -v 'README.org' \
      | sed -e 's|snippets/||;s|/| |' | sort
#+END_SRC

#+RESULTS: List-installed-yasnippets
| Mode              | Snippet                           |
|-------------------+-----------------------------------|
| graphviz-dot-mode | edge-with-attributes-bracket      |
| graphviz-dot-mode | image-attribute                   |
| graphviz-dot-mode | invisible-point                   |
| graphviz-dot-mode | node-with-attributes              |
| graphviz-dot-mode | node-with-shape-and-label         |
| graphviz-dot-mode | shape-attribute                   |
| graphviz-dot-mode | style-invisible                   |
| graphviz-dot-mode | tooltip-attribute                 |
| graphviz-dot-mode | url-attribute                     |
| graphviz-dot-mode | url-attribute-with-injected-class |
| graphviz-dot-mode | url-attribute-with-target         |
| org-mode          | Dot-Graph-Template                |
| org-mode          | header-item                       |
| org-mode          | Insert-Org-Header-Args            |
| org-mode          | Named-Source-Code-Block           |
| org-mode          | table2                            |
| org-mode          | table3                            |

